In [2]:
import pandas as pd
import numpy as np

In [3]:
games_url = 'https://andybek.com/pandas-games'

In [4]:
games = pd.read_csv(games_url)

In [5]:
games.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3143 entries, 0 to 3142
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          3143 non-null   object
 1   Platform      3143 non-null   object
 2   Year          3088 non-null   float64
 3   Genre         3143 non-null   object
 4   Publisher     3136 non-null   object
 5   NA_Sales      3143 non-null   float64
 6   EU_Sales      3143 non-null   float64
 7   JP_Sales      3143 non-null   float64
 8   Other_Sales   3143 non-null   float64
 9   Global_Sales  3143 non-null   float64
dtypes: float64(6), object(4)
memory usage: 245.7+ KB

In [16]:
gamesdf = pd.DataFrame(games)
mynewdf = gamesdf.loc[:,['Year','Platform','NA_Sales','EU_Sales','JP_Sales','Other_Sales']]

In [17]:
mynewdf

        Year Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales
0     2010.0     X360     14.97      4.94      0.24         1.67
1     2013.0      PS3      7.01      9.27      0.97         4.14
2     2013.0     X360      9.63      5.31      0.06         1.38
3     2011.0     X360      9.03      4.28      0.13         1.32
4     2010.0     X360      9.67      3.73      0.11         1.13
...      ...      ...       ...       ...       ...          ...
3138  2014.0     X360      0.00      0.01      0.00         0.00
3139  2016.0     XOne      0.01      0.00      0.00         0.00
3140  2016.0     XOne      0.01      0.00      0.00         0.00
3141  2016.0      PS4      0.00      0.01      0.00         0.00
3142  2016.0     XOne      0.00      0.01      0.00         0.00

[3143 rows x 6 columns]

In [31]:
yearfilter = mynewdf[(mynewdf["Platform"] =='X360') & (mynewdf["Year"].between(2013,2016))]
yearfilter

        Year Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales
2     2013.0     X360      9.63      5.31      0.06         1.38
17    2013.0     X360      6.72      2.63      0.04         0.82
22    2013.0     X360      5.58      2.83      0.02         0.77
81    2013.0     X360      0.92      2.93      0.01         0.46
82    2014.0     X360      2.75      1.18      0.00         0.37
...      ...      ...       ...       ...       ...          ...
3088  2014.0     X360      0.01      0.00      0.00         0.00
3089  2013.0     X360      0.00      0.00      0.01         0.00
3113  2015.0     X360      0.00      0.01      0.00         0.00
3127  2015.0     X360      0.00      0.01      0.00         0.00
3138  2014.0     X360      0.00      0.01      0.00         0.00

[188 rows x 6 columns]

In [32]:
mysum = yearfilter.sum()

In [33]:
mysum

Year                                                    378613.0
Platform       X360X360X360X360X360X360X360X360X360X360X360X3...
NA_Sales                                                   80.69
EU_Sales                                                   46.81
JP_Sales                                                    0.51
Other_Sales                                                11.83
dtype: object

Group By

In [35]:
import seaborn as sns

In [36]:
titanic = sns.load_dataset('titanic')

In [37]:
print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [38]:
titanic.groupby(['pclass','sex'])['age'].max()

pclass  sex
1       female    63.0
        male      80.0
2       female    57.0
        male      70.0
3       female    63.0
        male      74.0
Name: age, dtype: float64

In [39]:
titanic.groupby(['sex','pclass'])['survived'].sum()

sex     pclass
female  1         91
        2         70
        3         72
male    1         45
        2         17
        3         47
Name: survived, dtype: int64

In [40]:
titanic.groupby(['sex'])['survived'].sum()

sex
female    233
male      109
Name: survived, dtype: int64

In [42]:
titanic['fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64

In [44]:
titanic['fare'].groupby([titanic['sex'],titanic['pclass']]).sum()

sex     pclass
female  1         9975.8250
        2         1669.7292
        3         2321.1086
male    1         8201.5875
        2         2132.1125
        3         4393.5865
Name: fare, dtype: float64

In [45]:
yearfilter = mynewdf[(mynewdf["Platform"] =='X360') & (mynewdf["Year"].between(2013,2016))]

In [46]:
yearfilter

        Year Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales
2     2013.0     X360      9.63      5.31      0.06         1.38
17    2013.0     X360      6.72      2.63      0.04         0.82
22    2013.0     X360      5.58      2.83      0.02         0.77
81    2013.0     X360      0.92      2.93      0.01         0.46
82    2014.0     X360      2.75      1.18      0.00         0.37
...      ...      ...       ...       ...       ...          ...
3088  2014.0     X360      0.01      0.00      0.00         0.00
3089  2013.0     X360      0.00      0.00      0.01         0.00
3113  2015.0     X360      0.00      0.01      0.00         0.00
3127  2015.0     X360      0.00      0.01      0.00         0.00
3138  2014.0     X360      0.00      0.01      0.00         0.00

[188 rows x 6 columns]

In [47]:
mynewdf

        Year Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales
0     2010.0     X360     14.97      4.94      0.24         1.67
1     2013.0      PS3      7.01      9.27      0.97         4.14
2     2013.0     X360      9.63      5.31      0.06         1.38
3     2011.0     X360      9.03      4.28      0.13         1.32
4     2010.0     X360      9.67      3.73      0.11         1.13
...      ...      ...       ...       ...       ...          ...
3138  2014.0     X360      0.00      0.01      0.00         0.00
3139  2016.0     XOne      0.01      0.00      0.00         0.00
3140  2016.0     XOne      0.01      0.00      0.00         0.00
3141  2016.0      PS4      0.00      0.01      0.00         0.00
3142  2016.0     XOne      0.00      0.01      0.00         0.00

[3143 rows x 6 columns]

In [ ]:
#groupby se kro es question ko

In [ ]:
# Q.

In [69]:
df = pd.DataFrame({"key1":['a','a','b','b','a'],"key2":['one','two','one','two','one'],"data1": [-0.328944,1.345895,1.130837,-1.094334,-1.521817],"data2":[0.736485,-0.862979,-2.286525,-0.339157,0.333159]})

In [53]:
df

  key1 key2     data1     data2
0    a  one -0.328944  0.736485
1    a  two  1.345895 -0.862979
2    b  one  1.130837 -2.286525
3    b  two -1.094334 -0.339157
4    a  one -1.521817  0.333159

In [ ]:
newdf = pd.DataFrame({"key":['a','a','b','b','a'],"key2":['one','two','one','two','one'],

In [55]:
myobj = df.groupby(['key1','data1'])

In [59]:
myobj.sum()

               key2     data2
key1 data1
a    -1.521817  one  0.333159
     -0.328944  one  0.736485
      1.345895  two -0.862979
b    -1.094334  two -0.339157
      1.130837  one -2.286525

In [58]:
df.groupby(['key1'])

                         key2
key1 data1     data2
a    -1.521817  0.333159  one
     -0.328944  0.736485  one
      1.345895 -0.862979  two
b    -1.094334 -0.339157  two
      1.130837 -2.286525  one

In [60]:
states = np.array(['Ohio','California','California','Ohio','Ohio'])

In [61]:
states

array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='<U10')

In [62]:
years = np.array([2005,2005,2006,2005,2006])
years

array([2005, 2005, 2006, 2005, 2006])

In [66]:
df.insert(1,'states',states)

In [67]:
df.insert(2,'years',years)

In [68]:
df

  key1      states  years key2     data1     data2
0    a        Ohio   2005  one -0.328944  0.736485
1    a  California   2005  two  1.345895 -0.862979
2    b  California   2006  one  1.130837 -2.286525
3    b        Ohio   2005  two -1.094334 -0.339157
4    a        Ohio   2006  one -1.521817  0.333159

In [70]:
df

  key1 key2     data1     data2
0    a  one -0.328944  0.736485
1    a  two  1.345895 -0.862979
2    b  one  1.130837 -2.286525
3    b  two -1.094334 -0.339157
4    a  one -1.521817  0.333159

In [ ]:
df.groupby(['data1'])